// src/data/products.js

export const products = [
  {
    id: "roman-standard", // Това ще е част от URL-а: /product/roman-standard
    name: 'Римска щора "Стандарт"',
    price: '45 лв/кв.м',
    category: 'roman',
    shortDesc: 'Класически дизайн и лесна поддръжка.',
    description: 'Нашият модел "Стандарт" е перфектният баланс между цена и качество. Изработен от устойчив полиестер, който не задържа прах и се почиства лесно. Механизмът е скрит и осигурява плавно движение.',
    images: [
       // Първата снимка е главна
      "https://images.unsplash.com/photo-1505691938895-1758d7bab58d?w=800", 
      "https://images.unsplash.com/photo-1513694203232-719a280e022f?w=800",
      "https://images.unsplash.com/photo-1461988320302-91b564c5c9bc?w=800"
    ],
    specs: {
      "Материал": "100% Полиестер",
      "Степен на затъмнение": "50% (Пропуска светлина)",
      "Механизъм": "Chain System (С верижка)",
      "Гаранция": "24 месеца",
      "Произход": "Италия"
    }
  },
  {
    id: "roman-blackout",
    name: 'Римска щора "Blackout"',
    price: '65 лв/кв.м',
    category: 'roman',
    shortDesc: 'Пълно затъмнение за спокоен сън.',
    description: 'Специализирана тъкан с гумирано покритие от задната страна, което блокира 100% от слънчевата светлина. Идеални за спални и детски стаи.',
    images: [
      "https://images.unsplash.com/photo-1461988320302-91b564c5c9bc?w=800",
      "https://images.unsplash.com/photo-1505691938895-1758d7bab58d?w=800"
    ],
    specs: {
      "Материал": "Blackout Textil",
      "Степен на затъмнение": "100%",
      "Механизъм": "Chain System",
      "Гаранция": "36 месеца",
      "Произход": "Германия"
    }
  },
  {
    id: "vertical-classic",
    name: 'Вертикални щори', //името на продукта
    price: ' от 5€/кв.м / 9,78лв./кв.м', //цената на продукта
    category: 'vertical', //категорията
    shortDesc: 'Елегантно решение за големи прозорци и офиси.', //краткият описание
    description: 'Класически вертикални щори с текстилни и PVC ленти. Предлагат отличен контрол на светлината чрез прецизно завъртане на ламелите. Подходящи както за дома така и за бизнес пространства.!!! цената на щората се формира от сбора на сумите за релсов механизъм и текстил / pvc  лента.', //подробно описание
    images: [
      "/images/vertical/vertical-gray.png",
      "/images/vertical/vertical-orange.png",
      "/images/vertical/vertical-gray2.jpg",
      "/images/vertical/vertical-gray3.png",
      "/images/vertical/vertical-office.jpg", 
      "/images/vertical/vertical-beige.png"
    ],
    specs: {
      "Материал": "Антистатичен текстил / PVC",
      "Ширина на лентата": "89 мм",
      "Цена на релсов механизъм": "18€ на л.м",
      "Монтаж": "Таван/Стена"
    } //технически характеристики
  },
  {
    id: "venetian-aluminum",
    name: 'Венециански щори', //името на продукта
    price: 'от 19,90€ / 38,92лв./кв.м', //цената на продукта
    category: 'venetian', //категорията
    shortDesc: 'Практичен и икономичен начин за декориране на прозорците.', //краткият описание
    description: ' Венециански алуминиеви щори приложими във всички помещения на дома и офиса. Предлагат пълна дискретност и контрол на потока на светлината. Възможност за изпълнение в black out вариант.', //подробно описание
    images: [
      "/images/venetian/venetian-1.png",
      "/images/venetian/venetian-2.png",
      "/images/venetian/venetian-3.png",
      "/images/venetian/venetian-4.png",
      "/images/venetian/venetian-5.png" 
    ],
    specs: {
      "Материал": "Алуминий",
      "Ширина на ламелите": " 25мм / 16мм",
      "Управление": "Ръчно",
      "Монтаж": "Челен / Таван"
    } ,
    features: [
      "Квадратура под 0,5 кв.м. се изчислява за 0,5 кв.м.",
      "Изпълнение на щори с нестандартна  форма завишение 50%"
    ]
  },
   {
    id: "plise-standard",
    name: 'Плисе щори', 
    price: 'от 49.00€ / 95.84лв./кв.м', 
    category: 'plise', 
    shortDesc: 'Модерен и компактен избор за вашите прозорци.', 
    description: ' Плисе щори изработени от лек плат нагънат на хармоника. Те предлагат страхотен контрол на светлината като същевременно заемат минимално място. Предлагат се в различни варианти – от полупрозрачни до Blackout (пълно затъмняване).', 
    images: [
      "/images/plise/normal/plise-1.png",
      "/images/plise/normal/plise-2.png",
      "/images/plise/normal/plise-3.png",
      "/images/plise/normal/plise-4.png"
    ],
    specs: {
      "Материал": "Teкстил",
      "Цена на механизъм": "8.00€ / 15.65лв./л.м",
      "Цветове на механизъм": "Бял, Черен, Кафяв, Венге, Махагон, Антрацит, Злато",
      "Управление": "Ръчно",
      "Монтаж": "На дограма"
    } ,
    features: [
      "Квадратура под 1 кв.м. се остойностява за 1 кв.м.",
      "Изпълнение на щори с нестандартна форма завишение 40%"
  ]
   },
  {
    id: "plise-perfect-fit",
    name: 'Плисе щори /  PERFECT FIT /', 
    price: 'от 49.00€ / 95.84лв./кв.м', 
    category: 'plise', 
    shortDesc: 'Модерен и компактен избор за вашите прозорци', 
    description: 'Плисе щорите в рамка са идеално, модерно решение, предлагащи плътно прилепване и отлична термоизолация. Те се спускат/вдигат двупосочно, подходящи за наклонени прозорци , образувайки едно цяло с прозореца. ', 
    images: [
      "/images/plise/perfectfit/plise-1.png",
      "/images/plise/perfectfit/plise-2.png",
      "/images/plise/perfectfit/plise-3.png",
      "/images/plise/perfectfit/plise-4.png",
      "/images/plise/perfectfit/plise-5.png",
      "/images/plise/perfectfit/plise-6.png"
    ],
    specs: {
      "Материал": "Teкстил",
      "Цена на механизъм": " 9,50 € / 18,58 лв./л.м за бяла рамка ",
      "Цена цветен механизъм": "11,50 € / 22,49 лв./л.м за цветна рамка",
      "Цветове на механизъм": "Бял, Черен, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "На дограма"
    } ,
    features: [
        "Цената на щората се формира от сбора на сумата л.м. на рамката и кв.м. на текстила",
        "Квадратура под 1 кв.м. се остойностява за 1 кв.м.",
        "Минимална дълбочина на стъклодържача 15 мм.",
        "Събиране на щората отгоре надолу и отдолу нагоре с елегантна дръжка, прикрита в алуминиевия профил",
        "Подходяща за всички наклонени прозорци",
        "Рамка PERFECT FIT, която застава върху рамката на прозореца и защитава по-добре от светлина и видимост, прикривайки страничните отвори"

    ]
  },
  {
    id: "wooden-classic",
    name: 'Дървени щори', 
    price: 'от 99.00€ / 193,63лв./кв.м', 
    category: 'wooden', 
    shortDesc: 'Усещане за топлина и уют в помещенията..', 
    description: 'Дървените  щори са изборът на взискателни клиенти. Перфектно допълнение в интериора на домове, ресторанти и хотели. вграденият декоративен корниз придава още по-изтънчен вид на щората.', 
    images: [
      "/images/wooden/wooden-1.png",
      "/images/wooden/wooden-2.png",
      "/images/wooden/wooden-3.png",
      "/images/wooden/wooden-4.png",
      "/images/wooden/wooden-5.png" 
    ],
    specs: {
      "Материал": "Естествена дървесина / Бамбук",
      "ширина на ламелите": "50мм",
      "Управление": "Ръчно",
      "Монтаж": "Челен / Таван"
    } ,
    features: [
      "Квадратура под 1 кв.м. се остойностява за 1 кв.м.",
      "Минимална ширина 40 см.",  
      "Максимална ширина 210 см.",
      "Максимална площ 4 кв.м.",
      "ВНИМАНИЕ! Дървените щори са натурален продукт, структурата и нюанса на ламелите може да варира. Това е типичен ефект на естественото дърво, затова е нормално да има лека разлика, между мострата и готовия продукт"
  ],
  }
  // Можеш да добавиш още продукти тук...
];