// src/data/products.js

export const products = [
  {
    id: "vertical-classic",
    name: 'Вертикални щори', //името на продукта
    price: ' от 5€/кв.м / 9,78лв./кв.м', //цената на продукта
    category: 'vertical', //категорията
    shortDesc: 'Елегантно решение за големи прозорци и офиси.', //краткият описание
    description: 'Класически вертикални щори с текстилни и PVC ленти. Предлагат отличен контрол на светлината чрез прецизно завъртане на ламелите. Подходящи както за дома така и за бизнес пространства.!!! цената на щората се формира от сбора на сумите за релсов механизъм и текстил / pvc  лента.', //подробно описание
    images: [
      "images/vertical/vertical-gray.png",
      "images/vertical/vertical-orange.png",
      "images/vertical/vertical-gray2.jpg",
      "images/vertical/vertical-gray3.png",
      "images/vertical/vertical-office.jpg", 
      "images/vertical/vertical-beige.png"
    ],
    specs: {
      "Материал": "Антистатичен текстил / PVC",
      "Ширина на лентата": "89 мм",
      "Цена на релсов механизъм": "18€ на л.м",
      "Монтаж": "Таван/Стена"
    } //технически характеристики
  },
  {
    id: "venetian-aluminum",
    name: 'Венециански щори', //името на продукта
    price: 'от 19,90€ / 38,92лв./кв.м', //цената на продукта
    category: 'venetian', //категорията
    shortDesc: 'Практичен и икономичен начин за декориране на прозорците.', //краткият описание
    description: ' Венециански алуминиеви щори приложими във всички помещения на дома и офиса. Предлагат пълна дискретност и контрол на потока на светлината. Възможност за изпълнение в black out вариант.', //подробно описание
    images: [
      "images/venetian/venetian-1.png",
      "images/venetian/venetian-2.png",
      "images/venetian/venetian-3.png",
      "images/venetian/venetian-4.png",
      "images/venetian/venetian-5.png" 
    ],
    specs: {
      "Материал": "Алуминий",
      "Ширина на ламелите": " 25мм / 16мм",
      "Управление": "Ръчно",
      "Монтаж": "Челен / Таван"
    } ,
    features: [
      "Квадратура под 0,5 кв.м. се изчислява за 0,5 кв.м.",
      "Изпълнение на щори с нестандартна  форма завишение 50%"
    ]
  },
   {
    id: "plise-standard",
    name: 'Плисе щори', 
    price: 'от 49.00€ / 95.84лв./кв.м', 
    category: 'plise', 
    shortDesc: 'Модерен и компактен избор за вашите прозорци.', 
    description: ' Плисе щори изработени от лек плат нагънат на хармоника. Те предлагат страхотен контрол на светлината като същевременно заемат минимално място. Предлагат се в различни варианти – от полупрозрачни до Blackout (пълно затъмняване).', 
    images: [
      "images/plise/normal/plise-1.png",
      "images/plise/normal/plise-2.png",
      "images/plise/normal/plise-3.png",
      "images/plise/normal/plise-4.png"
    ],
    specs: {
      "Материал": "Teкстил",
      "Цена на механизъм": "8.00€ / 15.65лв./л.м",
      "Цветове на механизъм": "Бял, Черен, Кафяв, Венге, Махагон, Антрацит, Злато",
      "Управление": "Ръчно",
      "Монтаж": "На дограма"
    } ,
    features: [
      "Квадратура под 1 кв.м. се остойностява за 1 кв.м.",
      "Изпълнение на щори с нестандартна форма завишение 40%"
  ]
   },
  {
    id: "plise-perfect-fit",
    name: 'Плисе щори /  PERFECT FIT /', 
    price: 'от 49.00€ / 95.84лв./кв.м', 
    category: 'plise', 
    shortDesc: 'Модерен и компактен избор за вашите прозорци', 
    description: 'Плисе щорите в рамка са идеално, модерно решение, предлагащи плътно прилепване и отлична термоизолация. Те се спускат/вдигат двупосочно, подходящи за наклонени прозорци , образувайки едно цяло с прозореца. ', 
    images: [
      "images/plise/perfectfit/plise-1.png",
      "images/plise/perfectfit/plise-2.png",
      "images/plise/perfectfit/plise-3.png",
      "images/plise/perfectfit/plise-4.png",
      "images/plise/perfectfit/plise-5.png",
      "images/plise/perfectfit/plise-6.png"
    ],
    specs: {
      "Материал": "Teкстил",
      "Цена на механизъм": " 9,50 € / 18,58 лв./л.м за бяла рамка ",
      "Цена цветен механизъм": "11,50 € / 22,49 лв./л.м за цветна рамка",
      "Цветове на механизъм": "Бял, Черен, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "На дограма"
    } ,
    features: [
        "Цената на щората се формира от сбора на сумата л.м. на рамката и кв.м. на текстила",
        "Квадратура под 1 кв.м. се остойностява за 1 кв.м.",
        "Минимална дълбочина на стъклодържача 15 мм.",
        "Събиране на щората отгоре надолу и отдолу нагоре с елегантна дръжка, прикрита в алуминиевия профил",
        "Подходяща за всички наклонени прозорци",
        "Рамка PERFECT FIT, която застава върху рамката на прозореца и защитава по-добре от светлина и видимост, прикривайки страничните отвори"

    ]
  },
  {
    id: "wooden-classic",
    name: 'Дървени щори', 
    price: 'от 99.00€ / 193,63лв./кв.м', 
    category: 'wooden', 
    shortDesc: 'Усещане за топлина и уют в помещенията..', 
    description: 'Дървените  щори са изборът на взискателни клиенти. Перфектно допълнение в интериора на домове, ресторанти и хотели. вграденият декоративен корниз придава още по-изтънчен вид на щората.', 
    images: [
      "images/wooden/wooden-1.png",
      "images/wooden/wooden-2.png",
      "images/wooden/wooden-3.png",
      "images/wooden/wooden-4.png",
      "images/wooden/wooden-5.png" 
    ],
    specs: {
      "Материал": "Естествена дървесина / Бамбук",
      "ширина на ламелите": "50мм",
      "Управление": "Ръчно",
      "Монтаж": "Челен / Таван"
    } ,
    features: [
      "Квадратура под 1 кв.м. се остойностява за 1 кв.м.",
      "Минимална ширина 40 см.",  
      "Максимална ширина 210 см.",
      "Максимална площ 4 кв.м.",
      "ВНИМАНИЕ! Дървените щори са натурален продукт, структурата и нюанса на ламелите може да варира. Това е типичен ефект на естественото дърво, затова е нормално да има лека разлика, между мострата и готовия продукт"
  ]
  },
  {
    id: "vertical-day-and-night",
    name: "Вертикални Ден и Нощ", 
    price: 'от 28.00€ / 54,76лв./кв.м', 
    category: 'vertical-day-night', 
    shortDesc: 'Щора, перде и завеса, всичко това в едно цяло.', 
    description: 'Вертикалните щори „ден и нощ“ съчетават ефирна прозрачност с текстурирана плътна материя. Тези щори позволяват свободно преминаване между лентите, без нужда от събиране.  Всяка лента може да се сваля и подменя или почиства индивидуално, което прави поддръжката бърза и лесна. Освен естетика перде щората предлага и отлична функционалност.', 
    images: [
      "images/vertical-day-night/vertical-day-night-1.jpg",
      "images/vertical-day-night/vertical-day-night-2.jpg",
      "images/vertical-day-night/vertical-day-night-3.jpg",
      "images/vertical-day-night/vertical-day-night-4.png",
      "images/vertical-day-night/vertical-day-night-5.jpg",
      "images/vertical-day-night/vertical-day-night-6.jpg" 
    ],
    specs: {
      "Материал": "Антистатичен текстил",
      "ширина на ламелите": "40см / 30см",
      "Цена на механиизъм": "17,50 € / 34,23 лв./л.м",
      "Цветове на механизъм": "Бял, Черен, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "Стена / Таван"
    } ,
    features: [
      "цената на щората се формира от сбора на сумите за релсов механизъм и текстил",
      "максимална височина 390 см",  
      "релсов механизъм под 1 л.м се остойностява за 1 л.м",
  ],
  },
   {
    id: 'harmonica"',
    name: "Хармония", 
    price: 'от 35.00€ / 68,45лв./кв.м', 
    category: 'harmony', 
    shortDesc: 'Дизайнерско решение за дома', 
    description: 'Щорите тип „Хармония“ ( „Двойна хармония“) представляват модерен и иновативен вид вътрешни щори, които съчетават функционалността на вертикалните щори с ефирността и стила на класическите пердета. Състоят се от вертикални ламели изработени от текстил с pvc пълнеж, които са съединени от ефирна, прозрачна материя (тюл) между тях. Меката, полупрозрачна материя филтрира светлината, омекотява я и осигурява видимост навън, като същевременно запазва уединението,', 
    images: [
      "images/harmony/harmony-1.jpg",
      "images/harmony/harmony-2.jpg",
      "images/harmony/harmony-3.jpg",
      "images/harmony/harmony-4.jpg",
      "images/harmony/harmony-5.jpg" 
    ],
    specs: {
      "Материал": "Антистатичен текстил / PVC / Тюл",
      "Цена на механиизъм": "17,50 € / 34,23 лв./л.м",
      "Цветове на механизъм": "Бял, Черен, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "Стена / Таван"
    } 
  },
   {
    id: 'day-and-night-MAX"',
    name: "Ден и Нощ  MAX / MAX BOX", 
    price: 'от 18.00€ / 35.20лв./кв.м', 
    category: 'day-night', 
    shortDesc: 'Модерна визия подходяща за всяко помещение с големи прозорци', 
    description: 'Ден и Нощ Max и Max box са висококачествени, усилени щори, специално проектирани за закриване на големи прозорци и витрини. Те използват система от два слоя текстил (редуващи се прозрачни и непрозрачни ивици) за контрол на светлината, монтират се на стена или таван и предлагат стилен завършек с разнообразни цветове на плата. Моделът е идеален за големи френски прозорци, витрини или плъзгащи се врати, където стандартните щори не биха били достатъчно здрави. Разликата между Мax и Мax box е в това, че във вариант Мax box механизма на щората е скрит в стилна касета изработена от алуминий.', 
    images: [
      "images/day-night/max/day-night-max-1.jpg",
      "images/day-night/max/day-night-max-2.jpg",
      "images/day-night/max/day-night-max-3.jpg",
      "images/day-night/max/day-night-max-4.jpg",
      "images/day-night/max/day-night-max-5.jpg" 
    ],
    specs: {
      "Материал": "Антистатичен текстил",
      "Цена на механиизъм": "27 € / 52.81 лв./л.м",
      "Цветове на механизъм": "Бял, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "Стена / Таван"
    } ,
    features: [
      "цената на щората се формира от сбора на сумите за релсов механизъм и текстил",
      "механизъм под 1л.м. се остойностява за 1л.м.",  
      "текстил под 1кв.м. се остойностява за 1кв.м.",
  ] 
  },
   {
    id: 'day-and-night-box"',
    name: "Ден и Нощ BOX", 
    price: 'от 18.00€ / 35.20лв./кв.м', 
    category: 'day-night', 
    shortDesc: 'Функционалност и естетика в дома', 
    description: 'Щорите "Ден и Нощ" с кутия и водачи представляват иновативно и елегантно решение за контрол на светлината, съчетаващо функционалността на руло щорите с прецизността на венецианските щори. Системата с кутия и водачи осигурява плътно прилепване към прозореца и завършен вид. Горната част на щората е скрита в елегантна кутия изработена от алуминий. От двете страни на стъклодържача се монтират странични водачи, които придържат плата плътно до стъклото. Тази система елиминира страничните пролуки, през които би могла да влиза светлина и предотвратява провисването или люлеенето на щората при отваряне на прозореца.', 
    images: [
      "images/day-night/box/day-night-box-1.jpg",
      "images/day-night/box/day-night-box-2.jpg",
      "images/day-night/box/day-night-box-3.jpg",
      "images/day-night/box/day-night-box-4.jpg",
      "images/day-night/box/day-night-box-5.jpg",
      "images/day-night/box/day-night-box-6.png" 
    ],
    specs: {
      "Материал": "Антистатичен текстил",
      "Цена на механиизъм": "27 € / 52.81 лв./л.м",
      "Цветове на механизъм": "Бял, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "На дограма"
    } ,
    features: [
      "цената на щората се формира от сбора на сумите за релсов механизъм и текстил",
      "механизъм под 1л.м. се остойностява за 1л.м.",  
      "текстил под 1кв.м. се остойностява за 1кв.м.",
  ] 
  },
     {
    id: 'roller-blinds-max',
    name: " Руло щори MAX / MAX BOX", 
    price: 'от 19.00€ / 17.60лв./кв.м', 
    category: 'roller', 
    shortDesc: 'Стабилност и завършен вид за големи пространства', 
    description: 'Руло щорите от сериите MAX, MAXI и MAX BOX са специализирани решения за по-големи остъклени площи и специфични интериорни нужди. Те се отличават с подсилени механизми и възможност за покриване на широки пространства, които стандартните модели не могат да обхванат. Налични са опции за пълно затъмнение (Blackout), термозащита и антибактериални покрития.', 
    images: [
      "images/roller/roll/roller-1.jpg",
      "images/roller/roll/roller-2.jpg",
      "images/roller/roll/roller-3.jpg",
      "images/roller/roll/roller-4.jpg",
      "images/roller/roll/roller-5.jpg" 
    ],
    specs: {
      "Материал": "Антистатичен текстил",
      "Цена на механиизъм": "20  € / 39,12 лв./л.м",
      "Цветове на механизъм": "Бял, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "Стена / Таван"
    } ,
    features: [
      "цената на щората се формира от сбора на сумата за механизъм и текстил - механизъм под 1 л.м. се остойностява за 1 л.м.",
      "текстил под 1кв.м. се остойностява за 1кв.м",  
    ] 
  },
       {
    id: 'roller-blinds-box',
    name: "Руло щори с кутия и водачи", 
    price: 'от 9.00€ / 17.60лв./кв.м', 
    category: 'roller', 
    shortDesc: 'Идеален избор за всяко помещение', 
    description: 'Руло щорите с кутия и водачи са най-модерното решение за PVC и алуминиева дограма. Те се монтират директно върху стъклопакета, като алуминиева кутия скрива плата, а страничните водачи прилепват плътно, предотвратявайки пролуки, осигурявайки перфектно засенчване и прибиране.', 
    images: [
      "images/roller/box/roller-box-1.jpg",
      "images/roller/box/roller-box-2.jpg",
      "images/roller/box/roller-box-3.jpg",
      "images/roller/box/roller-box-4.jpg",
      "images/roller/box/roller-box-5.jpg",
      "images/roller/box/roller-box-6.jpg",
      "images/roller/box/roller-box-7.png" 
    ],
    specs: {
      "Материал": "Антистатичен текстил",
      "Цена на механиизъм": "27  € / 52.81 лв./л.м",
      "Цветове на механизъм": "Бял, Кафяв, Антрацит",
      "Управление": "Ръчно",
      "Монтаж": "На дограма"
    } ,
    features: [
      "цената на щората се формира от сбора на сумата за механизъм и текстил",
      "механизъм под 1 л.м. се остойностява за 1 л.м.",
      "текстил под 1кв.м. се остойностява за 1кв.м. "
    ] 
  },
    {
    id: 'roman-blinds',
    name: "Римски щори ", 
    price: 'от 19.00€ / 37.16лв./кв.м', 
    category: 'roman', 
    shortDesc: 'Придайте романтичен и топъл вид на дома си', 
    description: 'Римските щори са стилна и компактна алтернатива на класическите завеси, подходящи за всяко помещение в дома. Съчетавайки луксозни платове с безупречна изработка те добавят изисканост, топлина и уют. Богатият избор на цветове, десени и подплати - включително blackout - улеснява съчетанието с всеки интериор. Предлагаме изработка в mini, max и max box вариант.', 
    images: [
      "images/roman/roman-1.jpg",
      "images/roman/roman-2.jpg",
      "images/roman/roman-3.jpg",
      "images/roman/roman-4.jpg",
      "images/roman/roman-5.jpg",
      "images/roman/roman-6.jpg" 
    ],
    specs: {
      "Материал": "Антистатичен текстил",
      "Цена на механиизъм": "27  € / 52.81 лв./л.м",
      "Цветове на механизъм": "Бял, Черен, Кафяв, Антрацит",
      "максимална ширина": "275 см",
      "максимална височина": "450 см",
      "Управление": "Ръчно",
      "Монтаж": "Стена / Таван / с Конзоли"
    } ,
    features: [
      "Mini вариант (в цената на щората са включени механизъм и текстил)",
      "Max и Max box варианти (цената на щората се формира от сбора на сумата за механизъм и текстил)",
      "Механизъм под 1 л.м. се остойностява за 1 л.м.",
      "Текстил под 1кв.м. се остойностява за 1кв.м. ",
      "Ширината на текстила е по-малка от габаритната ширина на щората с 4 см. при  MAX  и с 2,5 см. при  MAX BOX."
    ] 
  },
  {
  id: "motorized-rail-system", // Използваме латиница за линка
  name: "Автоматизирана релса за пердета и завеси",
  price: "от 159 € / 310.98 лв.", // Привличащо вниманието стартово число
  category: "motorized", 
  
  shortDesc: "Комбинация от лукс и удобство. Интелигентни моторизирани корнизи за всеки интериор.",
  description: "Автоматизираните релси за пердета и завеси (моторизирани корнизи) са модерни системи, които позволяват отваряне и затваряне на завесите без ръчна намеса, чрез електрически мотор, монтиран към релсата. Те предлагат комбинация от лукс, удобство и енергийна ефективност, подходящи както за домове, така и за офиси, конферентни зали и хотели.",
  
  // Тук визуализираме пакетите и екстрите
  features: [
    "КОМПЛЕКТ ДО 320 СМ ( 159 € / 310.98 лв.) - Включва: релсов механизъм, 2-канално дистанционно, ел. мотор",
    "КОМПЛЕКТ ДО 520 СМ (179 € / 350.09 лв.) - Включва: релсов механизъм, 2-канално дистанционно, ел. мотор",
    "КОМПЛЕКТ ДО 720 СМ ( 199 € / 389.21 лв.) - Включва: релсов механизъм, 2-канално дистанционно, ел. мотор",
    "Функция 'Touch Motion' – възможност за ръчно управление само с леко издърпване на завесата"
  ],

  // Техническите детайли отиват в таблицата
  specs: {
    "Цвят на механизъм": "Бял",
    "Управление": "Автоматизирано (с дистанционно)",
    "Монтаж": "Стена или Таван",
    "Захранване": "220 V"
  },
  
  // Не забравяй да добавиш реални снимки тук
  images: [
    "images/motorized/motorized-1.jpg",
    "images/motorized/motorized-2.jpg"
  ]
}
  // Можеш да добавиш още продукти тук...
];